In [33]:
#updating columns in pandas
student = {
    "student_name":["lavanya","jaanu","lakshith","dakshith"],
    "student_degree":["bca","bca","third","fifth"],
    "student_grade":["A","A","B","C"]
}
print(student)

{'student_name': ['lavanya', 'jaanu', 'lakshith', 'dakshith'], 'student_degree': ['bca', 'bca', 'third', 'fifth'], 'student_grade': ['A', 'A', 'B', 'C']}

In [34]:
import pandas as pd
df = pd.DataFrame(student)
df

  student_name student_degree student_grade
0      lavanya            bca             A
1        jaanu            bca             A
2     lakshith          third             B
3     dakshith          fifth             C

In [35]:
df.rename(columns={'student_name':'studentname',
                   'student_degree':'studentdegree',
                   'student_grade':'studentgrade'},inplace=True)

In [36]:
df

  studentname studentdegree studentgrade
0     lavanya           bca            A
1       jaanu           bca            A
2    lakshith         third            B
3    dakshith         fifth            C

In [38]:
df.columns

Index(['studentname', 'studentdegree', 'studentgrade'], dtype='object')

In [43]:
df.columns = [i.upper() for i in df.columns]

In [45]:
df

  STUDENTNAME STUDENTDEGREE STUDENTGRADE
0     lavanya           bca            A
1       jaanu           bca            A
2    lakshith         third            B
3    dakshith         fifth            C

In [48]:
columns = df.columns
print(columns)

Index(['STUDENTNAME', 'STUDENTDEGREE', 'STUDENTGRADE'], dtype='object')

In [50]:
df.columns = [i.lower() for i in columns]

In [51]:
df

  studentname studentdegree studentgrade
0     lavanya           bca            A
1       jaanu           bca            A
2    lakshith         third            B
3    dakshith         fifth            C